report.org
# name:   report_1000.org
# author: nbehrnd@yahoo.com
# date:   2021-09-09 (YYYY-MM-DD)
# edit:   2021-09-13 (YYYY-MM-DD)

* Motivation

  The disagreement between OpenBabel and RDKit on one hand, and DataWarrior on
  the other hand, about the InChiKeys assigned to the structures need not be a
  disagreement on the level where these are hashed from the intermediate InChi.
  Instead, there already could be differences assigning the InChi.  A previous
  run with a set with 250 molecules could be to small to provide a reasonable
  picture.

  Again, the Python interface to OpenBabel (version 3.1.1, as provided in the
  repositories of Debian 12/bookworm, branch testing) is used for an inspection.
  Scripts used are written for and used from the CLI of standard CPython
  (version 3.9.2 as installed from Debian's repositories).
  
* Test run (n = 1k), OpenBabel

