report.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-20 Mon 16:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="norwid" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44b9517">1. Motivation</a></li>
<li><a href="#orgf8fe330">2. Test run (n = 1k), OpenBabel</a>
<ul>
<li><a href="#orgc6e7dc7">2.1. preparation</a></li>
<li><a href="#org9149d2c">2.2. Conclusion</a></li>
</ul>
</li>
<li><a href="#org76a35eb">3. Test run (n = 5k), OpenBabel</a></li>
<li><a href="#org7934c20">4. Test run, (n = 1k), RDKit</a></li>
<li><a href="#orge6f15a7">5. Test run, (n = 5k), RDKit</a></li>
<li><a href="#orgfa8ad6e">6. Single molecule</a></li>
<li><a href="#orge780ba7">7. Cross-check InChI trust reference</a></li>
<li><a href="#orgc16b2b3">8. Cross-check with the InChI trust reference, b</a></li>
</ul>
</div>
</div>
<div id="outline-container-org44b9517" class="outline-2">
<h2 id="org44b9517"><span class="section-number-2">1.</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
The disagreement between OpenBabel and RDKit on one hand, and DataWarrior on
the other hand, about the InChiKeys assigned to the structures need not be a
disagreement on the level where these are hashed from the intermediate InChi.
Instead, there already could be differences assigning the InChi.  A previous
run with a set with 250 molecules could be to small to provide a reasonable
picture.
</p>

<p>
Again, the Python interface to OpenBabel (version 3.1.1, as provided in the
repositories of Debian 12/bookworm, branch testing) is used for an inspection.
Scripts used are written for and used from the CLI of standard CPython
(version 3.9.2 as installed from Debian's repositories).
</p>
</div>
</div>

<div id="outline-container-orgf8fe330" class="outline-2">
<h2 id="orgf8fe330"><span class="section-number-2">2.</span> Test run (n = 1k), OpenBabel</h2>
<div class="outline-text-2" id="text-2">
</div>
