report.org
** preparation 

   With DataWarrior's default settings, a random library of 1000 molecules was
   generated (file =Random_Molecules_1000.dwar=).  These were exported directly
   into a structure file (file =Random_Molecules_1000.sdf=).

   Script =obabel_inchi.py= was used to read DataWarrior's =.sdf= to count the
   chiral atoms, double bonds unrelated to cycles and to assign SMILES, InChi,
   and InChiKeys.  The script wrote file =analysis.txt= as permanent record with
   column headers obstereo, obEZ, obSMILES, obInChi, and obInChiKey
   respectively.  To ease interaction with DataWarrior, the tables were
   separated by tabulators.

   The content of file =analysis.txt= was pasted into a pristine running
   instance of DataWarrior including the header line.  DataWarrior macro
   =ob_dw_check.dwam= was imported and run to
   + assign SMILES, Inchi, and InChiKey by DataWarrior based on OpenBabel's
     SMILES
   + to compare e.g., obSMILES (SMILES by OpenBabel) with dwSMILES (SMILES by
     DW) as strings.  The Boolean relation =str(obSMILES) == str(dwSMILES)=
     either yields =1= (one) if these strings match each other, or =0= (zero) if
     the strings compared with each other are different.
   The results were saved in file =Random_Molecules_1000_check.dwar=.  The sort
   of the entries (e.g., number of stereogenic centers (=obstereo=) as first,
   the number of exocyclic double bonds (=obEZ=) as second criterion), again
   supports the hypothesis of identical InChi assigned by OpenBabel and DW for
   all compounds lacking a stereogenic center and an exocyclic double bond.

   Note the advantage of this .dwar file to narrow down interactively the
   molecules of interest with the slide rules (e.g., number of double bonds,
   chiral centers, level of the Boolean comparisons).

   It equally is possible to sort the entries for similarity/dissimilarity of
   the SMILES strings (column =diff_smiles=).  Since the same structure may be
   expressed differently (e.g., =c1ccncc1= and =c1ccccn1= both about pyridine),
   this criterion however is not pursued further.

   The content of =Random_Molecules_1000_check.dwar= was exported as text (File
   -> Save Special -> Textfile) as file =Random_Molecules_1000_check.txt=.
   Python script =table_stat.py= was used to group the molecules by number of
   stereogenic centers, number of exocyclic double bonds and if the strings of
   the InChi assigned by OpenBabel and DW match (=1=) or not (=0=).  With file
   =frequency_List.txt=, the script generated a permanent record.

   This frequency count is the basis for the following table.

   #+NAME:  tab_Random_Molecules_1000
   |---------------+---------------+------------------+-----+--------------|
   | molecule type | InChi (match) | InChi (no match) | sum | rel. correct |
   | (stereo, EZ)  |               |                  |     | [in percent] |
   |---------------+---------------+------------------+-----+--------------|
   | 0 0           |           341 |                0 | 341 |       100.00 |
   | 0 1           |            20 |               79 |  99 |        20.20 |
   | 0 2           |             0 |               38 |  38 |         0.00 |
   | 0 3           |             0 |                6 |   6 |         0.00 |
   | 0 4           |             0 |                2 |   2 |         0.00 |
   | 1 0           |           190 |               15 | 205 |        92.68 |
   | 1 1           |            12 |               57 |  69 |        17.39 |
   | 1 2           |             0 |               21 |  21 |         0.00 |
   | 1 3           |             0 |                3 |   3 |         0.00 |
   | 1 4           |             0 |                2 |   2 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 2 0           |            64 |               32 |  96 |        66.67 |
   | 2 1           |             3 |               33 |  36 |         8.33 |
   | 2 2           |             0 |                4 |   4 |         0.00 |
   | 2 3           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 3 0           |            18 |               20 |  38 |        47.37 |
   | 3 1           |             1 |                8 |   9 |        11.11 |
   | 3 2           |             0 |                2 |   2 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 4 0           |             6 |               11 |  17 |        35.29 |
   | 4 1           |             0 |                5 |   5 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 5 0           |             1 |                2 |   3 |        33.33 |
   | 5 1           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 6 1           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 7 0           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
 #+TBLFM: $4=$2 + $3::$5=($2/$4)*100;%.2f

** Conclusion

   Except for molecules lacking stereogenic centers and exocyclic double bonds,
   apparently, there are differences in the assignment of InChi by current
   OpenBabel (version 3.1.1) and DataWarrior (development version for Mac/Linux,
   fetched by <2021-09-07 Tue>).

   The limited compilation is interpreted as if the presence of exocyclic double
   bonds were of stronger influence than the presence of chiral centers to
   reduce the probability of a matching InChi by both generators.
   
