report.html
<div id="outline-container-orgc6e7dc7" class="outline-3">
<h3 id="orgc6e7dc7"><span class="section-number-3">2.1.</span> preparation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
With DataWarrior's default settings, a random library of 1000 molecules was
generated (file <code>Random_Molecules_1000.dwar</code>).  These were exported directly
into a structure file (file <code>Random_Molecules_1000.sdf</code>).
</p>

<p>
Script <code>obabel_inchi.py</code> was used to read DataWarrior's <code>.sdf</code> to count the
chiral atoms, double bonds unrelated to cycles and to assign SMILES, InChi,
and InChiKeys.  The script wrote file <code>analysis.txt</code> as permanent record with
column headers obstereo, obEZ, obSMILES, obInChi, and obInChiKey
respectively.  To ease interaction with DataWarrior, the tables were
separated by tabulators.
</p>

<p>
The content of file <code>analysis.txt</code> was pasted into a pristine running
instance of DataWarrior including the header line.  DataWarrior macro
<code>ob_dw_check.dwam</code> was imported and run to
</p>
<ul class="org-ul">
<li>assign SMILES, Inchi, and InChiKey by DataWarrior based on OpenBabel's
SMILES</li>
<li>to compare e.g., obSMILES (SMILES by OpenBabel) with dwSMILES (SMILES by
DW) as strings.  The Boolean relation <code>str(obSMILES) =</code> str(dwSMILES)=
either yields <code>1</code> (one) if these strings match each other, or <code>0</code> (zero) if
the strings compared with each other are different.</li>
</ul>
<p>
The results were saved in file <code>Random_Molecules_1000_check.dwar</code>.  The sort
of the entries (e.g., number of stereogenic centers (<code>obstereo</code>) as first,
the number of exocyclic double bonds (<code>obEZ</code>) as second criterion), again
supports the hypothesis of identical InChi assigned by OpenBabel and DW for
all compounds lacking a stereogenic center and an exocyclic double bond.
</p>

<p>
Note the advantage of this .dwar file to narrow down interactively the
molecules of interest with the slide rules (e.g., number of double bonds,
chiral centers, level of the Boolean comparisons).
</p>

<p>
It equally is possible to sort the entries for similarity/dissimilarity of
the SMILES strings (column <code>diff_smiles</code>).  Since the same structure may be
expressed differently (e.g., <code>c1ccncc1</code> and <code>c1ccccn1</code> both about pyridine),
this criterion however is not pursued further.
</p>

<p>
The content of <code>Random_Molecules_1000_check.dwar</code> was exported as text (File
-&gt; Save Special -&gt; Textfile) as file <code>Random_Molecules_1000_check.txt</code>.
Python script <code>table_stat.py</code> was used to group the molecules by number of
stereogenic centers, number of exocyclic double bonds and if the strings of
the InChi assigned by OpenBabel and DW match (<code>1</code>) or not (<code>0</code>).  With file
<code>frequency_List.txt</code>, the script generated a permanent record.
</p>

<p>
This frequency count is the basis for the following table.
</p>

<table id="org090a7f6" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">molecule type</th>
<th scope="col" class="org-right">InChi (match)</th>
<th scope="col" class="org-right">InChi (no match)</th>
<th scope="col" class="org-right">sum</th>
<th scope="col" class="org-right">rel. correct</th>
</tr>

<tr>
<th scope="col" class="org-left">(stereo, EZ)</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">[in percent]</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0 0</td>
<td class="org-right">341</td>
<td class="org-right">0</td>
<td class="org-right">341</td>
<td class="org-right">100.00</td>
</tr>

<tr>
<td class="org-left">0 1</td>
<td class="org-right">20</td>
<td class="org-right">79</td>
<td class="org-right">99</td>
<td class="org-right">20.20</td>
</tr>

<tr>
<td class="org-left">0 2</td>
<td class="org-right">0</td>
<td class="org-right">38</td>
<td class="org-right">38</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 3</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 4</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 0</td>
<td class="org-right">190</td>
<td class="org-right">15</td>
<td class="org-right">205</td>
<td class="org-right">92.68</td>
</tr>

<tr>
<td class="org-left">1 1</td>
<td class="org-right">12</td>
<td class="org-right">57</td>
<td class="org-right">69</td>
<td class="org-right">17.39</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-right">0</td>
<td class="org-right">21</td>
<td class="org-right">21</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 4</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2 0</td>
<td class="org-right">64</td>
<td class="org-right">32</td>
<td class="org-right">96</td>
<td class="org-right">66.67</td>
</tr>

<tr>
<td class="org-left">2 1</td>
<td class="org-right">3</td>
<td class="org-right">33</td>
<td class="org-right">36</td>
<td class="org-right">8.33</td>
</tr>

<tr>
<td class="org-left">2 2</td>
<td class="org-right">0</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">2 3</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3 0</td>
<td class="org-right">18</td>
<td class="org-right">20</td>
<td class="org-right">38</td>
<td class="org-right">47.37</td>
</tr>

<tr>
<td class="org-left">3 1</td>
<td class="org-right">1</td>
<td class="org-right">8</td>
<td class="org-right">9</td>
<td class="org-right">11.11</td>
</tr>

<tr>
<td class="org-left">3 2</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4 0</td>
<td class="org-right">6</td>
<td class="org-right">11</td>
<td class="org-right">17</td>
<td class="org-right">35.29</td>
</tr>

<tr>
<td class="org-left">4 1</td>
<td class="org-right">0</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">5 0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">33.33</td>
</tr>

<tr>
<td class="org-left">5 1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">6 1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">7 0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9149d2c" class="outline-3">
<h3 id="org9149d2c"><span class="section-number-3">2.2.</span> Conclusion</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Except for molecules lacking stereogenic centers and exocyclic double bonds,
apparently, there are differences in the assignment of InChi by current
OpenBabel (version 3.1.1) and DataWarrior (development version for Mac/Linux,
fetched by <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-07 Tue&gt;</span></span>).
</p>

<p>
The limited compilation is interpreted as if the presence of exocyclic double
bonds were of stronger influence than the presence of chiral centers to
reduce the probability of a matching InChi by both generators.
</p>
</div>
</div>
</div>
