report.org
* Test run (n = 5k), OpenBabel

  This test departed from a random library of 5000 molecules deposit in file
  =Random_Molecules_5k.dwar=.  The data were processed as in the previous test
  with 1k of molecules.

     #+NAME:  tab_Random_Molecules_5k
   |---------------+---------------+------------------+------+--------------|
   | molecule type | InChi (match) | InChi (no match) |  sum | rel. correct |
   | (stereo, EZ)  |               |                  |      | [in percent] |
   |---------------+---------------+------------------+------+--------------|
   | 0 0           |          1846 |                0 | 1846 |       100.00 |
   | 0 1           |            87 |              465 |  552 |        15.76 |
   | 0 2           |             0 |              158 |  158 |         0.00 |
   | 0 3           |             0 |               30 |   30 |         0.00 |
   | 0 4           |             0 |                3 |    3 |         0.00 |
   | 0 5           |             0 |                2 |    2 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 1 0           |           867 |               61 |  928 |        93.43 |
   | 1 1           |            65 |              258 |  323 |        20.12 |
   | 1 2           |             0 |               88 |   88 |         0.00 |
   | 1 3           |             0 |               20 |   20 |         0.00 |
   | 1 4           |             0 |                7 |    7 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 2 0           |           362 |              134 |  496 |        72.98 |
   | 2 1           |            20 |              128 |  148 |        13.51 |
   | 2 2           |             1 |               24 |   25 |         4.00 |
   | 2 3           |             0 |                9 |    9 |         0.00 |
   | 2 4           |             0 |                1 |    1 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 3 0           |           104 |               70 |  174 |        59.77 |
   | 3 1           |             7 |               42 |   49 |        14.29 |
   | 3 2           |             1 |                7 |    8 |        12.50 |
   | 3 3           |             0 |                1 |    1 |         0.00 |
   | 3 4           |             0 |                1 |    1 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 4 0           |            17 |               48 |   65 |        26.15 |
   | 4 1           |             0 |               19 |   19 |         0.00 |
   | 4 2           |             0 |                3 |    3 |         0.00 |
   | 4 3           |             0 |                1 |    1 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 5 0           |             2 |               25 |   27 |         7.41 |
   | 5 1           |             2 |                2 |    4 |        50.00 |
   | 5 2           |             0 |                1 |    1 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 6 0           |             0 |                6 |    6 |         0.00 |
   | 6 1           |             0 |                1 |    1 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 7 1           |             0 |                2 |    2 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 8 0           |             0 |                1 |    1 |         0.00 |
   |---------------+---------------+------------------+------+--------------|
   | 11 1          |             0 |                1 |    1 |         0.00 |
 #+TBLFM: $4=$2 + $3::$5=($2/$4)*100;%.2f

     The InChi assigned by DataWarrior and OpenBabel match each other for all of
     1864 molecules lacking a stereogenic center and exocyclic double bond.  For
     molecules belonging to any other class, the propability that the two
     generators assign different InChi (and consequently, a different InChiKey)
     is considerably larger.

