report.html

<div id="outline-container-org76a35eb" class="outline-2">
<h2 id="org76a35eb"><span class="section-number-2">3.</span> Test run (n = 5k), OpenBabel</h2>
<div class="outline-text-2" id="text-3">
<p>
This test departed from a random library of 5000 molecules deposit in file
<code>Random_Molecules_5k.dwar</code>.  The data were processed as in the previous test
with 1k of molecules.
</p>

<table id="org1916990" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">molecule type</th>
<th scope="col" class="org-right">InChi (match)</th>
<th scope="col" class="org-right">InChi (no match)</th>
<th scope="col" class="org-right">sum</th>
<th scope="col" class="org-right">rel. correct</th>
</tr>

<tr>
<th scope="col" class="org-left">(stereo, EZ)</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">[in percent]</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0 0</td>
<td class="org-right">1846</td>
<td class="org-right">0</td>
<td class="org-right">1846</td>
<td class="org-right">100.00</td>
</tr>

<tr>
<td class="org-left">0 1</td>
<td class="org-right">87</td>
<td class="org-right">465</td>
<td class="org-right">552</td>
<td class="org-right">15.76</td>
</tr>

<tr>
<td class="org-left">0 2</td>
<td class="org-right">0</td>
<td class="org-right">158</td>
<td class="org-right">158</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 3</td>
<td class="org-right">0</td>
<td class="org-right">30</td>
<td class="org-right">30</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 4</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 5</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1 0</td>
<td class="org-right">867</td>
<td class="org-right">61</td>
<td class="org-right">928</td>
<td class="org-right">93.43</td>
</tr>

<tr>
<td class="org-left">1 1</td>
<td class="org-right">65</td>
<td class="org-right">258</td>
<td class="org-right">323</td>
<td class="org-right">20.12</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-right">0</td>
<td class="org-right">88</td>
<td class="org-right">88</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-right">0</td>
<td class="org-right">20</td>
<td class="org-right">20</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 4</td>
<td class="org-right">0</td>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2 0</td>
<td class="org-right">362</td>
<td class="org-right">134</td>
<td class="org-right">496</td>
<td class="org-right">72.98</td>
</tr>

<tr>
<td class="org-left">2 1</td>
<td class="org-right">20</td>
<td class="org-right">128</td>
<td class="org-right">148</td>
<td class="org-right">13.51</td>
</tr>

<tr>
<td class="org-left">2 2</td>
<td class="org-right">1</td>
<td class="org-right">24</td>
<td class="org-right">25</td>
<td class="org-right">4.00</td>
</tr>

<tr>
<td class="org-left">2 3</td>
<td class="org-right">0</td>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">2 4</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3 0</td>
<td class="org-right">104</td>
<td class="org-right">70</td>
<td class="org-right">174</td>
<td class="org-right">59.77</td>
</tr>

<tr>
<td class="org-left">3 1</td>
<td class="org-right">7</td>
<td class="org-right">42</td>
<td class="org-right">49</td>
<td class="org-right">14.29</td>
</tr>

<tr>
<td class="org-left">3 2</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">12.50</td>
</tr>

<tr>
<td class="org-left">3 3</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">3 4</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4 0</td>
<td class="org-right">17</td>
<td class="org-right">48</td>
<td class="org-right">65</td>
<td class="org-right">26.15</td>
</tr>

<tr>
<td class="org-left">4 1</td>
<td class="org-right">0</td>
<td class="org-right">19</td>
<td class="org-right">19</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">4 2</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">4 3</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">5 0</td>
<td class="org-right">2</td>
<td class="org-right">25</td>
<td class="org-right">27</td>
<td class="org-right">7.41</td>
</tr>

<tr>
<td class="org-left">5 1</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">50.00</td>
</tr>

<tr>
<td class="org-left">5 2</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">6 0</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">6 1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">7 1</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">8 0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">11 1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
</table>

<p>
The InChi assigned by DataWarrior and OpenBabel match each other for all of
1864 molecules lacking a stereogenic center and exocyclic double bond.  For
molecules belonging to any other class, the propability that the two
generators assign different InChi (and consequently, a different InChiKey)
is considerably larger.
</p>
</div>
</div>
