report.org
* Test run, (n = 1k), RDKit

  For the purpose of comparison, the scrutiny was repeated with the currently
  available version of RDKit (2021.03.5) packaged by Miniconda.  This approach
  was elected because this one is multiple releases ahead of the latest version
  (2020.09.5) currently packaged for Linux Debian 12/bookworm (branch testing).
  The approach aims to follow closely the previous analysis with OpenBabel.

  The same library, the same .sdf generated by DW about 1k drug like molecules
  was read by script =rdkit_inchi.py= to assign by RDKit SMILES, InChI, and
  InChIKey to yield intermediate file =RDKit_analysis.txt=.  The content of the
  later was pasted (including the header line) into DW.  DW converted RDKit's
  SMILES into structures.  Macro =rd_dw_check.dwam= was used to let DW assign
  SMILES, InChI, and InChiKey; the comparison of the strings equally was driven
  by this macro.  To retain interaction with the results (e. g., DW's sliders)
  results were saved in file =Random_Molecules_1000_check_rd.dwar=.

  The content was exported into file =Random_Molecules_1000_check_rd.txt=.  From
  branch OpenBabel, script =table_stat.py= was used again to yield a summary,
  file =frequency_list.txt=.

     #+NAME:  tab_Random_Molecules_1000_rdkit
   |---------------+---------------+------------------+-----+--------------|
   | molecule type | InChi (match) | InChi (no match) | sum | rel. correct |
   | (stereo, EZ)  |               |                  |     | [in percent] |
   |---------------+---------------+------------------+-----+--------------|
   | 0 0           |           341 |               74 | 415 |        82.17 |
   | 0 1           |            25 |                0 |  25 |       100.00 |
   | 0 2           |             1 |               37 |  38 |         2.63 |
   | 0 3           |             0 |                6 |   6 |         0.00 |
   | 0 4           |             0 |                2 |   2 |         0.00 |
   | 1 1           |           190 |               15 | 205 |        92.68 |
   | 1 2           |            15 |               54 |  69 |        21.74 |
   | 1 3           |             0 |               21 |  21 |         0.00 |
   | 1 4           |             0 |                3 |   3 |         0.00 |
   | 1 5           |             0 |                2 |   2 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 2 2           |            64 |               32 |  96 |        66.67 |
   | 2 3           |             4 |               32 |  36 |        11.11 |
   | 2 4           |             0 |                4 |   4 |         0.00 |
   | 2 5           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 3 3           |            18 |               20 |  38 |        47.37 |
   | 3 4           |             1 |                7 |   8 |        12.50 |
   | 3 5           |             0 |                2 |   2 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 4 4           |             6 |               11 |  17 |        35.29 |
   | 4 5           |             0 |                6 |   6 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 5 5           |             1 |                2 |   3 |        33.33 |
   | 5 6           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 6 7           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
   | 7 7           |             0 |                1 |   1 |         0.00 |
   |---------------+---------------+------------------+-----+--------------|
      #+TBLFM: $4=$2 + $3::$5=($2/$4)*100;%.2f

   It is noteworthy that this scrutiny does not support an earlier, perhaps
   rather implicit assumption that InChI by both generators would match each
   other in absence of stereogenic centers and E/Z double bonds.


