report.html

<div id="outline-container-org7934c20" class="outline-2">
<h2 id="org7934c20"><span class="section-number-2">4.</span> Test run, (n = 1k), RDKit</h2>
<div class="outline-text-2" id="text-4">
<p>
For the purpose of comparison, the scrutiny was repeated with the currently
available version of RDKit (2021.03.5) packaged by Miniconda.  This approach
was elected because this one is multiple releases ahead of the latest version
(2020.09.5) currently packaged for Linux Debian 12/bookworm (branch testing).
The approach aims to follow closely the previous analysis with OpenBabel.
</p>

<p>
The same library, the same .sdf generated by DW about 1k drug like molecules
was read by script <code>rdkit_inchi.py</code> to assign by RDKit SMILES, InChI, and
InChIKey to yield intermediate file <code>RDKit_analysis.txt</code>.  The content of the
later was pasted (including the header line) into DW.  DW converted RDKit's
SMILES into structures.  Macro <code>rd_dw_check.dwam</code> was used to let DW assign
SMILES, InChI, and InChiKey; the comparison of the strings equally was driven
by this macro.  To retain interaction with the results (e. g., DW's sliders)
results were saved in file <code>Random_Molecules_1000_check_rd.dwar</code>.
</p>

<p>
The content was exported into file <code>Random_Molecules_1000_check_rd.txt</code>.  From
branch OpenBabel, script <code>table_stat.py</code> was used again to yield a summary,
file <code>frequency_list.txt</code>.
</p>

<table id="org19ee696" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">molecule type</th>
<th scope="col" class="org-right">InChi (match)</th>
<th scope="col" class="org-right">InChi (no match)</th>
<th scope="col" class="org-right">sum</th>
<th scope="col" class="org-right">rel. correct</th>
</tr>

<tr>
<th scope="col" class="org-left">(stereo, EZ)</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">[in percent]</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0 0</td>
<td class="org-right">341</td>
<td class="org-right">74</td>
<td class="org-right">415</td>
<td class="org-right">82.17</td>
</tr>

<tr>
<td class="org-left">0 1</td>
<td class="org-right">25</td>
<td class="org-right">0</td>
<td class="org-right">25</td>
<td class="org-right">100.00</td>
</tr>

<tr>
<td class="org-left">0 2</td>
<td class="org-right">1</td>
<td class="org-right">37</td>
<td class="org-right">38</td>
<td class="org-right">2.63</td>
</tr>

<tr>
<td class="org-left">0 3</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 4</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 1</td>
<td class="org-right">190</td>
<td class="org-right">15</td>
<td class="org-right">205</td>
<td class="org-right">92.68</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-right">15</td>
<td class="org-right">54</td>
<td class="org-right">69</td>
<td class="org-right">21.74</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-right">0</td>
<td class="org-right">21</td>
<td class="org-right">21</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 4</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 5</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2 2</td>
<td class="org-right">64</td>
<td class="org-right">32</td>
<td class="org-right">96</td>
<td class="org-right">66.67</td>
</tr>

<tr>
<td class="org-left">2 3</td>
<td class="org-right">4</td>
<td class="org-right">32</td>
<td class="org-right">36</td>
<td class="org-right">11.11</td>
</tr>

<tr>
<td class="org-left">2 4</td>
<td class="org-right">0</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">2 5</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3 3</td>
<td class="org-right">18</td>
<td class="org-right">20</td>
<td class="org-right">38</td>
<td class="org-right">47.37</td>
</tr>

<tr>
<td class="org-left">3 4</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">12.50</td>
</tr>

<tr>
<td class="org-left">3 5</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4 4</td>
<td class="org-right">6</td>
<td class="org-right">11</td>
<td class="org-right">17</td>
<td class="org-right">35.29</td>
</tr>

<tr>
<td class="org-left">4 5</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">5 5</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">33.33</td>
</tr>

<tr>
<td class="org-left">5 6</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">6 7</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">7 7</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
</table>

<p>
It is noteworthy that this scrutiny does not support an earlier, perhaps
rather implicit assumption that InChI by both generators would match each
other in absence of stereogenic centers and E/Z double bonds.
</p>
</div>
</div>
