report.org
* Test run, (n = 5k), RDKit

  The library of 5k drug like molecules, submitted to the scrutiny as .sdf by
  RDKit.

  #+NAME:  tab_5k_Random_Molecules_5k_check_rd
  |---------------+---------------+------------------+------+--------------|
  | molecule type | InChi (match) | InChi (no match) |  sum | rel. correct |
  | (stereo, EZ)  |               |                  |      | [in percent] |
  |---------------+---------------+------------------+------+--------------|
  | 0 0           |          1844 |                2 | 1846 |        99.89 |
  | 0 1           |           125 |              427 |  552 |        22.64 |
  | 0 2           |             0 |              158 |  158 |         0.00 |
  | 0 3           |             0 |               29 |   29 |         0.00 |
  | 0 4           |             0 |                3 |    3 |         0.00 |
  | 0 5           |             0 |                3 |    3 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 1 1           |           867 |               61 |  928 |        93.43 |
  | 1 2           |            82 |              241 |  323 |        25.39 |
  | 1 3           |             0 |               88 |   88 |         0.00 |
  | 1 4           |             0 |               21 |   21 |         0.00 |
  | 1 5           |             0 |                6 |    6 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 2 2           |           362 |              133 |  495 |        73.13 |
  | 2 3           |            27 |              121 |  148 |        18.24 |
  | 2 4           |             2 |               24 |   26 |         7.69 |
  | 2 5           |             0 |                8 |    8 |         0.00 |
  | 2 6           |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 3 3           |           104 |               71 |  175 |        59.43 |
  | 3 4           |             8 |               40 |   48 |        16.67 |
  | 3 5           |             1 |                7 |    8 |        12.50 |
  | 3 6           |             0 |                2 |    2 |         0.00 |
  | 3 7           |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 4 4           |            17 |               48 |   65 |        26.15 |
  | 4 5           |             1 |               18 |   19 |         5.26 |
  | 4 6           |             0 |                3 |    3 |         0.00 |
  | 4 7           |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 5 5           |             2 |               25 |   27 |         7.41 |
  | 5 6           |             2 |                2 |    4 |        50.00 |
  | 5 7           |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 6 6           |             0 |                6 |    6 |         0.00 |
  | 6 7           |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 7 8           |             0 |                2 |    2 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 8 8           |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  | 11 10         |             0 |                1 |    1 |         0.00 |
  |---------------+---------------+------------------+------+--------------|
  #+TBLFM: $4=$2 + $3::$5=($2/$4)*100;%.2f

  In this scrutiny, the ratio of identical InChI strings about "simple
  molecules" (no chiral centre, no E/Z double bond) generated by two generators
  over the total of all molecules submitted is higher than in the earlier run (n
  = 1k).

* Single molecule

  In a pristine instance of DW, one early entry of the set of 1000 molecules
  known to be assinged different InChi by OpenBabel and DataWarrior is entered
  with the sketcher (file =single.dwar=).  It is a compound with one stereogenic
  center only (assigned as /S/) for which DW is again queried to assign an InChi
  (which is
  InChI=1S/C14H12O9/c1-2-6(17)23-13-8-7(4(15)3-5(16)10(8)18)11(19)9(12(13)20)14(21)22/h3,13,15-16,18,20H,2H2,1H3,(H,21,22)/t13-/m1/s1)

  The InChi is copy-pasted into the mask of the Chemical Identity Resolver of
  NIH' Cactus server (https://cactus.nci.nih.gov/chemical/structure). The visual
  representation however plots the enantiomer (explicitly assigned /R/). (URL
  assigned: https://cactus.nci.nih.gov/chemical/structure/InChI=1S/C14H12O9/c1-2-6(17)23-13-8-7(4(15)3-5(16)10(8)18)11(19)9(12(13)20)14(21)22/h3,13,15-16,18,20H,2H2,1H3,(H,21,22)/t13-/m1/s1/image)
  
     
