report.html


<div id="outline-container-orge6f15a7" class="outline-2">
<h2 id="orge6f15a7"><span class="section-number-2">5.</span> Test run, (n = 5k), RDKit</h2>
<div class="outline-text-2" id="text-5">
<p>
The library of 5k drug like molecules, submitted to the scrutiny as .sdf by
RDKit.
</p>

<table id="orgf133573" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">molecule type</th>
<th scope="col" class="org-right">InChi (match)</th>
<th scope="col" class="org-right">InChi (no match)</th>
<th scope="col" class="org-right">sum</th>
<th scope="col" class="org-right">rel. correct</th>
</tr>

<tr>
<th scope="col" class="org-left">(stereo, EZ)</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">[in percent]</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0 0</td>
<td class="org-right">1844</td>
<td class="org-right">2</td>
<td class="org-right">1846</td>
<td class="org-right">99.89</td>
</tr>

<tr>
<td class="org-left">0 1</td>
<td class="org-right">125</td>
<td class="org-right">427</td>
<td class="org-right">552</td>
<td class="org-right">22.64</td>
</tr>

<tr>
<td class="org-left">0 2</td>
<td class="org-right">0</td>
<td class="org-right">158</td>
<td class="org-right">158</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 3</td>
<td class="org-right">0</td>
<td class="org-right">29</td>
<td class="org-right">29</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 4</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">0 5</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1 1</td>
<td class="org-right">867</td>
<td class="org-right">61</td>
<td class="org-right">928</td>
<td class="org-right">93.43</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-right">82</td>
<td class="org-right">241</td>
<td class="org-right">323</td>
<td class="org-right">25.39</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-right">0</td>
<td class="org-right">88</td>
<td class="org-right">88</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 4</td>
<td class="org-right">0</td>
<td class="org-right">21</td>
<td class="org-right">21</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">1 5</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2 2</td>
<td class="org-right">362</td>
<td class="org-right">133</td>
<td class="org-right">495</td>
<td class="org-right">73.13</td>
</tr>

<tr>
<td class="org-left">2 3</td>
<td class="org-right">27</td>
<td class="org-right">121</td>
<td class="org-right">148</td>
<td class="org-right">18.24</td>
</tr>

<tr>
<td class="org-left">2 4</td>
<td class="org-right">2</td>
<td class="org-right">24</td>
<td class="org-right">26</td>
<td class="org-right">7.69</td>
</tr>

<tr>
<td class="org-left">2 5</td>
<td class="org-right">0</td>
<td class="org-right">8</td>
<td class="org-right">8</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">2 6</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3 3</td>
<td class="org-right">104</td>
<td class="org-right">71</td>
<td class="org-right">175</td>
<td class="org-right">59.43</td>
</tr>

<tr>
<td class="org-left">3 4</td>
<td class="org-right">8</td>
<td class="org-right">40</td>
<td class="org-right">48</td>
<td class="org-right">16.67</td>
</tr>

<tr>
<td class="org-left">3 5</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">12.50</td>
</tr>

<tr>
<td class="org-left">3 6</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">3 7</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4 4</td>
<td class="org-right">17</td>
<td class="org-right">48</td>
<td class="org-right">65</td>
<td class="org-right">26.15</td>
</tr>

<tr>
<td class="org-left">4 5</td>
<td class="org-right">1</td>
<td class="org-right">18</td>
<td class="org-right">19</td>
<td class="org-right">5.26</td>
</tr>

<tr>
<td class="org-left">4 6</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">4 7</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">5 5</td>
<td class="org-right">2</td>
<td class="org-right">25</td>
<td class="org-right">27</td>
<td class="org-right">7.41</td>
</tr>

<tr>
<td class="org-left">5 6</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">50.00</td>
</tr>

<tr>
<td class="org-left">5 7</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">6 6</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0.00</td>
</tr>

<tr>
<td class="org-left">6 7</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">7 8</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">8 8</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">11 10</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.00</td>
</tr>
</tbody>
</table>

<p>
In this scrutiny, the ratio of identical InChI strings about "simple
molecules" (no chiral centre, no E/Z double bond) generated by two generators
over the total of all molecules submitted is higher than in the earlier run (n
= 1k).
</p>
</div>
</div>

<div id="outline-container-orgfa8ad6e" class="outline-2">
<h2 id="orgfa8ad6e"><span class="section-number-2">6.</span> Single molecule</h2>
<div class="outline-text-2" id="text-6">
<p>
In a pristine instance of DW, one early entry of the set of 1000 molecules
known to be assinged different InChi by OpenBabel and DataWarrior is entered
with the sketcher (file <code>single.dwar</code>).  It is a compound with one stereogenic
center only (assigned as <i>S</i>) for which DW is again queried to assign an InChi
(which is
InChI=1S/C14H12O9/c1-2-6(17)23-13-8-7(4(15)3-5(16)10(8)18)11(19)9(12(13)20)14(21)22/h3,13,15-16,18,20H,2H2,1H3,(H,21,22)/t13-/m1/s1)
</p>

<p>
The InChi is copy-pasted into the mask of the Chemical Identity Resolver of
NIH' Cactus server (<a href="https://cactus.nci.nih.gov/chemical/structure">https://cactus.nci.nih.gov/chemical/structure</a>). The visual
representation however plots the enantiomer (explicitly assigned <i>R</i>). (URL
assigned: <a href="https://cactus.nci.nih.gov/chemical/structure/InChI=1S/C14H12O9/c1-2-6(17)23-13-8-7(4(15)3-5(16)10(8)18)11(19)9(12(13)20)14(21)22/h3,13,15-16,18,20H,2H2,1H3,(H,21,22)/t13-/m1/s1/image">https://cactus.nci.nih.gov/chemical/structure/InChI=1S/C14H12O9/c1-2-6(17)23-13-8-7(4(15)3-5(16)10(8)18)11(19)9(12(13)20)14(21)22/h3,13,15-16,18,20H,2H2,1H3,(H,21,22)/t13-/m1/s1/image</a>)
</p>
</div>
</div>
