report.org
* Cross-check InChI trust reference

  For the assignment of molecular structures encoded as a =.sdf=, the InChI
  trust distributes the reference implemention for the assignment of InChI and
  InChIKeys as a compiled executable, e.g., for Linux.  Both test sets of 1k and
  5k molecules were submitted to this assignment.

  #+NAME: tab_cross_check_1k
  #+CAPTION: Difference analysis for the assignments by OpenBabel, RDKit, DataWarrior /vs./ InChI; 1k set.
  |                     | =diff_stereo_ob_rd= | =diff_ez_ob_rd= | =diff_structure_ob_rd= | =inchi_ob_vs_inchi= | =inchi_rd_vs_inchi= | =inchi_dw_vs_inchi= |
  |---------------------+---------------------+-----------------+------------------------+---------------------+---------------------+---------------------|
  | count (match):      |                 999 |             486 |                    981 |                 983 |                1000 |                 666 |
  | count (differ):     |                   1 |             514 |                     19 |                  17 |                   0 |                 334 |
  | sum (match+differ): |                1000 |            1000 |                   1000 |                1000 |                1000 |                1000 |
  | difference [%]      |                0.10 |           51.40 |                   1.90 |                1.70 |                0.00 |               33.40 |
  |---------------------+---------------------+-----------------+------------------------+---------------------+---------------------+---------------------|

  
  #+NAME: tab_cross_check_5k
  #+CAPTION: Difference analysis for the assignments by OpenBabel, RDKit, DataWarrior /vs./ InChI; 5k set.
  |                     | =diff_stereo_ob_rd= | =diff_ez_ob_rd= | =diff_structure_ob_rd= | =inchi_ob_vs_inchi= | =inchi_rd_vs_inchi= | =inchi_dw_vs_inchi= |
  |---------------------+---------------------+-----------------+------------------------+---------------------+---------------------+---------------------|
  | count (match):      |                4999 |            2591 |                   4861 |                4866 |                4998 |                3444 |
  | count (differ):     |                   1 |            2409 |                    139 |                 134 |                   2 |                1556 |
  | sum (match+differ): |                5000 |            5000 |                   5000 |                5000 |                5000 |                5000 |
  | difference [%]      |                0.02 |           48.18 |                   2.78 |                2.68 |                0.04 |               31.12 |
  |---------------------+---------------------+-----------------+------------------------+---------------------+---------------------+---------------------|

  Lessons learnt:
  + Possibly, the moderator script for RDKit does not identify between well
    enough between double bonds not attached to/included in a cyclic system.
  + Either OpenBabel/RDKit interpret =.sdf= differently, or the SMILES assigned
    by them differs such that DataWarrior's structure codes occasionally change.
    This may, but need not be relevant how DataWarrior perceives the structures
    after importing their SMILES string in comparison to DataWarrior's direct
    import of .sdf files.
  + Assuming the implementation by the InChI trust as reference (1.06, december
    2020), about one in three structures was assigned a different InChI by
    DataWarrior (development version, Mac/Linux, fetched September 7th).  The
    differences drop by about a factor of 10 using OpenBabel (3.1.1, 134 out of
    5k entries with different assigment), and again by a factor of about 50
    using the current version of RDKit (2021.03.5, 2 out of 5k entries with
    different assignment).

* Cross-check with the InChI trust reference, b

  Based on commit =fa3b7a4= on Monday afternoon, 2021-09-20, Thomas Sander
  released a Linux development version of DW correcting most of the problems
  about the assignment of InChI and InChIKeys faced earlier.

  The same sets of 1k and 5k drug-like molecules were submitted to the
  assignment of InChI and InChIKey by DataWarrior.  These were compared against
  the reference executable for Linux, as distributed by the InChI trust (version
  1.06, december 2020).  In comparison to DataWarrior as met on September 7, the
  improvement is substantial; the rate of differences now is about the order of
  magnitude as observed for the analogue comparison between RDKit against the
  InChI trust reference:

  #+NAME:  tab_new_DW_vs_InChItrust_1k
  #+CAPTION: Difference count for InChI and InChIKey assigned by DataWarrior vs. InChI trust, 1k set.
  |                     | =diff_inchi_dw_inchi= | =inchikey_dw_vs_inchi= |
  |---------------------+-----------------------+------------------------|
  | count (match):      |                   998 |                    998 |
  | count (differ):     |                     2 |                      2 |
  | sum (match+differ): |                  1000 |                   1000 |
  | difference [%]      |                  0.20 |                   0.20 |
  |---------------------+-----------------------+------------------------|

  #+NAME:  tab_new_DW_vs_InChItrust_1k
  #+CAPTION: Difference count for InChI and InChIKey assigned by DataWarrior vs. InChI trust, 5k set.
  |                     | =diff_inchi_dwb_inchi= | =inchikey_dw_vs_inchi= |
  |---------------------+------------------------+------------------------|
  | count (match):      |                   4989 |                   4989 |
  | count (differ):     |                     11 |                     11 |
  | sum (match+differ): |                   5000 |                   5000 |
  | difference [%]      |                   0.22 |                   0.22 |
  |---------------------+------------------------+------------------------|

  As already recognized by Thomas, the (E)/(Z) configuration of oximes still
  represents a potential pitfall for the assignment of InChI.  This is going to
  be a different case.
