report.html


<div id="outline-container-orge780ba7" class="outline-2">
<h2 id="orge780ba7"><span class="section-number-2">7.</span> Cross-check InChI trust reference</h2>
<div class="outline-text-2" id="text-7">
<p>
For the assignment of molecular structures encoded as a <code>.sdf</code>, the InChI
trust distributes the reference implemention for the assignment of InChI and
InChIKeys as a compiled executable, e.g., for Linux.  Both test sets of 1k and
5k molecules were submitted to this assignment.
</p>

<table id="org634b76e" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Difference analysis for the assignments by OpenBabel, RDKit, DataWarrior <i>vs.</i> InChI; 1k set.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right"><code>diff_stereo_ob_rd</code></th>
<th scope="col" class="org-right"><code>diff_ez_ob_rd</code></th>
<th scope="col" class="org-right"><code>diff_structure_ob_rd</code></th>
<th scope="col" class="org-right"><code>inchi_ob_vs_inchi</code></th>
<th scope="col" class="org-right"><code>inchi_rd_vs_inchi</code></th>
<th scope="col" class="org-right"><code>inchi_dw_vs_inchi</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">count (match):</td>
<td class="org-right">999</td>
<td class="org-right">486</td>
<td class="org-right">981</td>
<td class="org-right">983</td>
<td class="org-right">1000</td>
<td class="org-right">666</td>
</tr>

<tr>
<td class="org-left">count (differ):</td>
<td class="org-right">1</td>
<td class="org-right">514</td>
<td class="org-right">19</td>
<td class="org-right">17</td>
<td class="org-right">0</td>
<td class="org-right">334</td>
</tr>

<tr>
<td class="org-left">sum (match+differ):</td>
<td class="org-right">1000</td>
<td class="org-right">1000</td>
<td class="org-right">1000</td>
<td class="org-right">1000</td>
<td class="org-right">1000</td>
<td class="org-right">1000</td>
</tr>

<tr>
<td class="org-left">difference [%]</td>
<td class="org-right">0.10</td>
<td class="org-right">51.40</td>
<td class="org-right">1.90</td>
<td class="org-right">1.70</td>
<td class="org-right">0.00</td>
<td class="org-right">33.40</td>
</tr>
</tbody>
</table>


<table id="org6c647b5" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Difference analysis for the assignments by OpenBabel, RDKit, DataWarrior <i>vs.</i> InChI; 5k set.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right"><code>diff_stereo_ob_rd</code></th>
<th scope="col" class="org-right"><code>diff_ez_ob_rd</code></th>
<th scope="col" class="org-right"><code>diff_structure_ob_rd</code></th>
<th scope="col" class="org-right"><code>inchi_ob_vs_inchi</code></th>
<th scope="col" class="org-right"><code>inchi_rd_vs_inchi</code></th>
<th scope="col" class="org-right"><code>inchi_dw_vs_inchi</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">count (match):</td>
<td class="org-right">4999</td>
<td class="org-right">2591</td>
<td class="org-right">4861</td>
<td class="org-right">4866</td>
<td class="org-right">4998</td>
<td class="org-right">3444</td>
</tr>

<tr>
<td class="org-left">count (differ):</td>
<td class="org-right">1</td>
<td class="org-right">2409</td>
<td class="org-right">139</td>
<td class="org-right">134</td>
<td class="org-right">2</td>
<td class="org-right">1556</td>
</tr>

<tr>
<td class="org-left">sum (match+differ):</td>
<td class="org-right">5000</td>
<td class="org-right">5000</td>
<td class="org-right">5000</td>
<td class="org-right">5000</td>
<td class="org-right">5000</td>
<td class="org-right">5000</td>
</tr>

<tr>
<td class="org-left">difference [%]</td>
<td class="org-right">0.02</td>
<td class="org-right">48.18</td>
<td class="org-right">2.78</td>
<td class="org-right">2.68</td>
<td class="org-right">0.04</td>
<td class="org-right">31.12</td>
</tr>
</tbody>
</table>

<p>
Lessons learnt:
</p>
<ul class="org-ul">
<li>Possibly, the moderator script for RDKit does not identify between well
enough between double bonds not attached to/included in a cyclic system.</li>
<li>Either OpenBabel/RDKit interpret <code>.sdf</code> differently, or the SMILES assigned
by them differs such that DataWarrior's structure codes occasionally change.
This may, but need not be relevant how DataWarrior perceives the structures
after importing their SMILES string in comparison to DataWarrior's direct
import of .sdf files.</li>
<li>Assuming the implementation by the InChI trust as reference (1.06, december
2020), about one in three structures was assigned a different InChI by
DataWarrior (development version, Mac/Linux, fetched September 7th).  The
differences drop by about a factor of 10 using OpenBabel (3.1.1, 134 out of
5k entries with different assigment), and again by a factor of about 50
using the current version of RDKit (2021.03.5, 2 out of 5k entries with
different assignment).</li>
</ul>
</div>
</div>

<div id="outline-container-orgc16b2b3" class="outline-2">
<h2 id="orgc16b2b3"><span class="section-number-2">8.</span> Cross-check with the InChI trust reference, b</h2>
<div class="outline-text-2" id="text-8">
<p>
Based on commit <code>fa3b7a4</code> on Monday afternoon, 2021-09-20, Thomas Sander
released a Linux development version of DW correcting most of the problems
about the assignment of InChI and InChIKeys faced earlier.
</p>

<p>
The same sets of 1k and 5k drug-like molecules were submitted to the
assignment of InChI and InChIKey by DataWarrior.  These were compared against
the reference executable for Linux, as distributed by the InChI trust (version
1.06, december 2020).  In comparison to DataWarrior as met on September 7, the
improvement is substantial; the rate of differences is about one order of
magnitude below the one seen for the analogue comparison between RDKit against
the InChI trust reference:
</p>

<table id="orgb2a2ea0" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Difference count for InChI and InChIKey assigned by DataWarrior vs. InChI trust, 1k set.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right"><code>diff_inchi_dw_inchi</code></th>
<th scope="col" class="org-right"><code>inchikey_dw_vs_inchi</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">count (match):</td>
<td class="org-right">998</td>
<td class="org-right">998</td>
</tr>

<tr>
<td class="org-left">count (differ):</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">sum (match+differ):</td>
<td class="org-right">1000</td>
<td class="org-right">1000</td>
</tr>

<tr>
<td class="org-left">difference [\%]</td>
<td class="org-right">0.20</td>
<td class="org-right">0.20</td>
</tr>
</tbody>
</table>

<table id="org0b1345b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Difference count for InChI and InChIKey assigned by DataWarrior vs. InChI trust, 5k set.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right"><code>diff_inchi_dwb_inchi</code></th>
<th scope="col" class="org-right"><code>inchikey_dw_vs_inchi</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">count (match):</td>
<td class="org-right">4989</td>
<td class="org-right">4989</td>
</tr>

<tr>
<td class="org-left">count (differ):</td>
<td class="org-right">11</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">sum (match+differ):</td>
<td class="org-right">5000</td>
<td class="org-right">5000</td>
</tr>

<tr>
<td class="org-left">difference [\%]</td>
<td class="org-right">0.22</td>
<td class="org-right">0.22</td>
</tr>
</tbody>
</table>

<p>
As already recognized by Thomas, the (E)/(Z) configuration of oximes still
represents a potential pitfall for the assignment of InChI.  This is going to
be a different case.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: norwid</p>
<p class="date">Created: 2021-09-20 Mon 16:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
